; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   blue_block_1 white_block_1 yellow_block_1 orange_block_1 orange_block_2 purple_block_1 blue_block_2 - block
 )
 (:init (ontable blue_block_1) (on white_block_1 blue_block_1) (on yellow_block_1 white_block_1) (ontable orange_block_1) (on orange_block_2 yellow_block_1) (on purple_block_1 orange_block_1) (on blue_block_2 purple_block_1) (clear orange_block_2) (clear blue_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (ontable orange_block_2)))
 (:constraints (sometime (and (not (clear blue_block_2)) (ontable yellow_block_1))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack orange_block_2 yellow_block_1)
   deleted: (on orange_block_2 yellow_block_1) (clear orange_block_2) (handempty)
   added: (holding orange_block_2) (clear yellow_block_1)
   goals met: 0 of 1
2. (stack orange_block_2 blue_block_2)
   deleted: (clear blue_block_2) (holding orange_block_2)
   added: (handempty) (clear orange_block_2) (on orange_block_2 blue_block_2)
   goals met: 0 of 1
3. (unstack yellow_block_1 white_block_1)
   deleted: (on yellow_block_1 white_block_1) (clear yellow_block_1) (handempty)
   added: (holding yellow_block_1) (clear white_block_1)
   goals met: 0 of 1
4. (putdown yellow_block_1)
   deleted: (holding yellow_block_1)
   added: (clear yellow_block_1) (handempty) (ontable yellow_block_1)
   goals met: 0 of 1
5. (unstack orange_block_2 blue_block_2)
   deleted: (on orange_block_2 blue_block_2) (clear orange_block_2) (handempty)
   added: (holding orange_block_2) (clear blue_block_2)
   goals met: 0 of 1
6. (putdown orange_block_2)
   deleted: (holding orange_block_2)
   added: (clear orange_block_2) (handempty) (ontable orange_block_2)
   goals met: 1 of 1
